0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
12225
(
(-0.0198086 0.000156695 3.39265e-20)
(-0.0182574 0.000156695 0)
(-0.0167681 0.000156695 1.84045e-20)
(-0.0153384 0.000156695 0)
(-0.0139658 0.000156695 0)
(-0.012648 0.000156695 0)
(-0.0113829 0.000156695 0)
(-0.0101683 0.000156695 0)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
30
(
(-0.0206 0.000156695 0)
(-0.0206 0.000486212 0)
(-0.0206 0.000849643 0)
(-0.0206 0.00125048 0)
(-0.0206 0.00169257 0)
(-0.0206 0.00218017 0)
(-0.0206 0.00271795 0)
(-0.0206 0.00322031 0)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
57
(
(0.29 -0.0163139 0)
(0.29 -0.0157417 0)
(0.29 -0.0151694 0)
(0.29 -0.0145972 0)
(0.29 -0.014025 0)
(0.29 -0.0134528 0)
(0.29 -0.0128806 0)
(0.29 -0.0123083 0)
...
)
;
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<vector> 
223
(
(-0.0198086 0.0254 0)
(-0.0182574 0.0254 0)
(-0.0167681 0.0254 0)
(-0.0153384 0.0254 0)
(-0.0139658 0.0254 0)
(-0.012648 0.0254 0)
(-0.0113829 0.0254 0)
(-0.0101683 0.0254 0)
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<vector> 
250
(
(-0.0198086 0 0)
(-0.0182574 0 0)
(-0.0167681 0 0)
(-0.0153384 0 0)
(-0.0139658 0 0)
(-0.012648 0 0)
(-0.0113829 0 0)
(-0.0101683 0 0)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
