0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
12225
(
0.000156695
0.000156695
0.000156695
0.000156695
0.000156695
0.000156695
0.000156695
0.000156695
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
30
(
0.000156695
0.000486212
0.000849643
0.00125048
0.00169257
0.00218017
0.00271795
0.00322031
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
57
(
-0.0163139
-0.0157417
-0.0151694
-0.0145972
-0.014025
-0.0134528
-0.0128806
-0.0123083
...
)
;
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
223
(
0.0254
0.0254
0.0254
0.0254
0.0254
0.0254
0.0254
0.0254
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
250
(
0
0
0
0
0
0
0
0
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
